[
  {
    "comment_id":"08ccc344-9d53-4b6e-ba01-935fc6538fcd",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that Chelsey C has helped the customer tremendously and allowed them to see the steps they need to take to achieve their goals. This indicates that Chelsey C's assistance has improved the usability of the product or service."
  },
  {
    "comment_id":"08ccc344-9d53-4b6e-ba01-935fc6538fcd",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Chelsey C is kind, empathetic, and works hard for creative solutions. This indicates that the customer had a positive experience with Chelsey C's customer service."
  },
  {
    "comment_id":"bc013c65-9b43-4c91-ac8a-3679e8a9ff17",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer feedback mentions that the staff at Evergreen Credit Union have been very helpful, pleasant, and efficient. This indicates positive customer service experience."
  },
  {
    "comment_id":"98b71ebe-0860-4a3d-970c-b959749f9c9c",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the staff is courteous, respectful, knowledgeable, and extremely responsive. It also states that they always thank the customer for being a customer. This indicates a positive experience with the customer service of Evergreen."
  },
  {
    "comment_id":"87413598-a62c-45be-867f-d37d4c34db7d",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentions that the staff at Evergreen Credit Union are friendly, personable, and willing to help with their needs. They feel good knowing they can make a call and receive assistance."
  },
  {
    "comment_id":"7d1cf9c4-828f-4c30-bc5c-d49e16bf76f5",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Jenn was so amazing. She really helped me throughout the process of my refinance. Kudos to her."
  },
  {
    "comment_id":"509ff9bc-c4e2-4469-95fa-76e6c25390f3",
    "Category":"Pricing",
    "Nature":"positive",
    "Analysis":"The comment mentions that they can get a solution that fits their needs at a reasonable price, indicating a positive perception of the pricing."
  },
  {
    "comment_id":"509ff9bc-c4e2-4469-95fa-76e6c25390f3",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment states that the representatives are knowledgeable and go out of their way to help, indicating a positive perception of the customer service."
  },
  {
    "comment_id":"709af966-3952-4562-9aa7-b538e1d6b1f3",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that JESSICA was extremely responsive and made the camper purchase very easy. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"709af966-3952-4562-9aa7-b538e1d6b1f3",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment states that as soon as the customer emailed JESSICA, she responded immediately. This indicates effective communication."
  },
  {
    "comment_id":"0cfdf873-2c51-42c5-b259-929731f18682",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Sara was excellent, explained all the necessary details, and provided helpful assistance. It also highlights her patience, consideration, and excellent customer service skills. The customer recommends her to others."
  },
  {
    "comment_id":"b8efb6b0-76eb-4372-a385-b1ff7b67d6f2",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that every time the customer calls, the employees are always polite and attentive."
  },
  {
    "comment_id":"747d3a8f-c178-491c-856a-916c00d68e97",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the woman in the office provided help in a kind and professional manner, indicating positive customer service experience."
  },
  {
    "comment_id":"15bcc28e-d4b8-41f2-9b96-051e7f8c5752",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Judy Brochu was sincerely warm, friendly, knowledgeable, and patient. She took the customer's information and passed it on to the correct department, resulting in the requested outcome. This indicates positive customer service experience."
  },
  {
    "comment_id":"15bcc28e-d4b8-41f2-9b96-051e7f8c5752",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Judy Brochu took the customer's information and passed it on by email to the correct department. This indicates effective communication."
  },
  {
    "comment_id":"55b686cc-164f-43ba-b315-ffd33d7ccf78",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the company went above and beyond to help the customer get a vehicle loan. They also mention that the company went out of their way to work with them when matching times to communicate were difficult. Additionally, the customer states that everyone they were in contact with, whether through phone calls, email, or text, were very friendly and responsive. This indicates a positive experience with the customer service provided."
  },
  {
    "comment_id":"55b686cc-164f-43ba-b315-ffd33d7ccf78",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the company was very responsive through phone calls, email, and text. This indicates effective communication from the company's side."
  },
  {
    "comment_id":"bdf9d26b-72c2-4005-ad59-367990ed8ba7",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The customer mentioned being surprised by how fast the car loan was approved, indicating a positive experience with the speed\/performance of the loan approval process."
  },
  {
    "comment_id":"6d687e8c-e406-4019-b93d-7badfddfad57",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Jenn Perreault was very pleasant to work with and knowledgeable about processing the customer's request for a personal loan, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"ccb4c6bf-57ad-4786-8d40-785cd97f34ae",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that the Evergreen employees have always quickly helped fix any issues, indicating positive customer service experiences."
  },
  {
    "comment_id":"f2182c88-a3a4-431a-a507-822ee5828630",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that Rebecca Lanefski listened to their needs, asked specific questions, and responded in a professional manner. This indicates that the usability of the service provided by Rebecca Lanefski was positive."
  },
  {
    "comment_id":"f2182c88-a3a4-431a-a507-822ee5828630",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The customer mentioned that Rebecca Lanefski answered the call politely, listened to their needs, and responded in a professional manner. This indicates positive customer service."
  },
  {
    "comment_id":"f2182c88-a3a4-431a-a507-822ee5828630",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The customer mentioned that Rebecca Lanefski listened to their needs, asked specific questions, and responded in a professional manner. This indicates positive communication."
  },
  {
    "comment_id":"269482f0-d077-4143-a46a-faabb97149d1",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Cassandra made the lease to used-car loan process easy, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"269482f0-d077-4143-a46a-faabb97149d1",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned positive experiences with both Cassandra and Isiah, indicating good customer service."
  },
  {
    "comment_id":"0cb5e6d9-8886-4306-b74a-4db19ac30194",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Julie Hamm in Mortgage Servicing has gone above and beyond to promptly respond and take care of the customer's financial needs. The customer appreciates her prompt and efficient response when in need of assistance."
  },
  {
    "comment_id":"1db70565-253f-4dd0-aaac-e0f2ae5f6c7b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Jennel berry was amazing and will be working with her again in the near future, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"3b6bc50a-87de-4dbe-be34-99e6c61a4700",
    "Category":"Customer Service",
    "Nature":"Negative",
    "Analysis":"The comment mentions that the people on the fraud prevention line were terrible and the woman was rude. This indicates a negative experience with the customer service."
  },
  {
    "comment_id":"7dc4ce1f-409b-45a7-ae3d-56fa31ebd29e",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer had a great experience with the customer service representative, Rebecca. She was extremely helpful, took control of the situation, and provided detailed assistance. The customer appreciated the support and the resolution of their issue."
  },
  {
    "comment_id":"7dc4ce1f-409b-45a7-ae3d-56fa31ebd29e",
    "Category":"Billing\/Invoicing",
    "Nature":"Negative",
    "Analysis":"The customer mentioned being late in paying their credit card bill due to a change in the date they received their money from Social Security. They were charged a $25 late fee as a result. This indicates a negative experience with the billing\/invoicing process."
  },
  {
    "comment_id":"7dc4ce1f-409b-45a7-ae3d-56fa31ebd29e",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Rebecca, the customer service representative, followed up with a detailed email outlining their conversation and what should happen now and in the future. This indicates good communication from the company."
  },
  {
    "comment_id":"07633a83-f9d4-4edb-87f6-9c4978205f39",
    "Category":"Pricing",
    "Nature":"Negative",
    "Analysis":"The customer mentions being charged around $500 instead of a nominal fee, indicating dissatisfaction with the pricing."
  },
  {
    "comment_id":"07633a83-f9d4-4edb-87f6-9c4978205f39",
    "Category":"Customer Service",
    "Nature":"Negative",
    "Analysis":"Evergreen Credit Union's response to the customer's complaint is dismissive and unhelpful, stating that reviews cannot be used in disputes and closing the case without addressing the issue satisfactorily."
  },
  {
    "comment_id":"07633a83-f9d4-4edb-87f6-9c4978205f39",
    "Category":"Billing\/Invoicing",
    "Nature":"Negative",
    "Analysis":"The customer mentions being charged incorrectly on their Evergreen account, indicating a problem with billing\/invoicing."
  },
  {
    "comment_id":"07633a83-f9d4-4edb-87f6-9c4978205f39",
    "Category":"Communication",
    "Nature":"Negative",
    "Analysis":"Evergreen Credit Union's response to the customer's complaint lacks effective communication and fails to address the customer's concerns adequately."
  },
  {
    "comment_id":"2a296a9a-0a47-4c76-a31e-c61ff0423f93",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Judy was calm, informative, patient, and lovely to speak to. She was able to find and solve the issue quickly, which indicates a positive customer service experience."
  },
  {
    "comment_id":"deafc939-902b-4a19-90b6-36a960e39102",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that the members were very knowledgeable and super responsive, working hard to address immediate and longer term financial needs. The help from Jenn and Chelsey was also appreciated, indicating a positive customer service experience."
  },
  {
    "comment_id":"87a5acce-96d7-463e-bf99-577c32228f75",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the staff at the South Portland location provides top-notch service, is friendly, and efficiently takes care of the customer's needs."
  },
  {
    "comment_id":"f6f6869a-280a-4c57-9587-2ba9b0cc7740",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Amanda and Judy did an amazing job helping the customer with their bill pay issue, indicating positive customer service experience."
  },
  {
    "comment_id":"737b9030-e6cf-40b0-ae21-5f8c4c33d263",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer finds the loan servicing easy and reliable, and the Evergreen app allows them to transfer funds between accounts quickly, pay their mortgage, and check the status of deposits easily."
  },
  {
    "comment_id":"737b9030-e6cf-40b0-ae21-5f8c4c33d263",
    "Category":"Product Features\/Functionality",
    "Nature":"Positive",
    "Analysis":"The customer mentions that the Evergreen app allows them to transfer funds between accounts quickly, pay their mortgage, and check the status of deposits easily."
  },
  {
    "comment_id":"5a84cfc2-205b-4b2a-a115-ebfbb263008a",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Chelsey Cargen was described as the most attentive and personal loan officer to work with, helping the customer get back on the road. The customer expressed a preference to work with Chelsey for financing."
  },
  {
    "comment_id":"152e4159-8742-479d-9ab7-5b9d075ee720",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Justin Collett has been responsive, informative, and a pleasure to work with. This indicates positive customer service experience."
  },
  {
    "comment_id":"152e4159-8742-479d-9ab7-5b9d075ee720",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Justin Collett has been responsive and informative, indicating positive communication experience."
  },
  {
    "comment_id":"729be9c4-f46e-4e18-8f69-709e8c98f003",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"Chelsey and Heidi provided excellent customer service by responding quickly, being with the customer every step of the way, and impressing the car dealer with their efficiency."
  },
  {
    "comment_id":"729be9c4-f46e-4e18-8f69-709e8c98f003",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"Evergreen's lending department was quick to respond to the customer's inquiry, even on a Sunday, which impressed the customer who works in banking."
  },
  {
    "comment_id":"5f6cae7d-193b-41d3-914d-377ead16633a",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Rebecca took care of the customer's issue and they are extremely grateful for her assistance."
  },
  {
    "comment_id":"116639f6-63f7-4525-a2f1-15443979a7b3",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Meghan Dudley did a fantastic job throughout the loan process, was always quick to communicate, and managed the complicated transaction with ease. This indicates a positive experience with the customer service provided by Meghan and Evergreen Credit Union."
  },
  {
    "comment_id":"116639f6-63f7-4525-a2f1-15443979a7b3",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Meghan Dudley was always quick to communicate, indicating a positive experience with the communication aspect of the loan process."
  },
  {
    "comment_id":"5ff9ef17-da24-4e3a-bdc5-acb45de56193",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment expresses appreciation for the customer service representative, Cassandra Hanson, who kept the promise of maintaining the 2% interest rate despite the increase in interest rates. This indicates a positive experience with the customer service provided."
  },
  {
    "comment_id":"5ff9ef17-da24-4e3a-bdc5-acb45de56193",
    "Category":"Delivery\/Shipping",
    "Nature":"Positive",
    "Analysis":"The comment mentions the delivery of the car taking place around May 22, indicating a successful delivery process. This implies a positive experience with the delivery\/shipping aspect."
  },
  {
    "comment_id":"5ff9ef17-da24-4e3a-bdc5-acb45de56193",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment highlights the communication between Cassandra Hanson and the upper management, where she convinced them to keep the interest rate at 2%. This suggests effective communication and negotiation skills, resulting in a positive outcome."
  },
  {
    "comment_id":"c00d5806-76f5-40f2-93ad-b535bdd5bd99",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Anne could not have been more helpful. She offered a few different options and helped me sort out the mystery charge on my Apple account. This indicates that the customer had a positive experience with the customer service provided by Anne."
  },
  {
    "comment_id":"c00d5806-76f5-40f2-93ad-b535bdd5bd99",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer mentions that Evergreen staff are always professional and nice about not always telling them what they want to hear. This indicates positive communication from the company."
  },
  {
    "comment_id":"2f0681d4-753f-4b00-9122-e08b0888ca0b",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The convenient location across from Riverside Auto and being open on Saturday morning made it easy for the customer to discuss an auto loan."
  },
  {
    "comment_id":"2f0681d4-753f-4b00-9122-e08b0888ca0b",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The team made the process simple and informative for a first-time car buyer."
  },
  {
    "comment_id":"9a144c32-19e5-4c66-a8dc-83c5972252d5",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the process from initial inquiry to securing a membership and vehicle loan was smooth and easy, indicating positive usability."
  },
  {
    "comment_id":"9a144c32-19e5-4c66-a8dc-83c5972252d5",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the process was quick and the replies were helpful, indicating positive speed\/performance."
  },
  {
    "comment_id":"9a144c32-19e5-4c66-a8dc-83c5972252d5",
    "Category":"Pricing",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the vehicle loan was secured at a very competitive rate, indicating positive pricing."
  },
  {
    "comment_id":"9a144c32-19e5-4c66-a8dc-83c5972252d5",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the folks they dealt with were outstanding, quick, helpful, and great to work with, indicating positive customer service."
  },
  {
    "comment_id":"9a144c32-19e5-4c66-a8dc-83c5972252d5",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the replies were quick and helpful, indicating positive communication."
  },
  {
    "comment_id":"63af3ba7-7725-428c-9d69-8dad5ff556b8",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Kacie Cannell was incredibly helpful, patient, courteous, and knowledgeable. The customer appreciated the effort made to ensure understanding and comfort throughout the loan application process. This indicates positive customer service experience."
  },
  {
    "comment_id":"63af3ba7-7725-428c-9d69-8dad5ff556b8",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Kacie Cannell patiently took calls and answered emails in a timely manner. This indicates positive communication experience."
  },
  {
    "comment_id":"7977f5f5-2bb0-4173-bae1-fec7de879234",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Rebecca was amazing, got right on the issue and helped me get documentation that I needed. Second day when I called back, she recognized my voice and was about to check status and call me back."
  },
  {
    "comment_id":"b7842d7d-b2a9-47e7-9f93-ada4fff3b40c",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Isaiah Wright, the loan officer, was very helpful, professional, well-informed, and provided a fantastic experience. The customer appreciates his thoroughness and great suggestions. Overall, the feedback indicates positive customer service."
  },
  {
    "comment_id":"1344f7c6-9739-4269-b911-2b8a3bdc6540",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the customer has always had amazing service and that Chelsey Cargen provided great communication and expectations for the loan. The customer feels like they were a priority and appreciated the guidance provided. Overall, the customer is highly satisfied with the customer service received."
  },
  {
    "comment_id":"1344f7c6-9739-4269-b911-2b8a3bdc6540",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment highlights that Chelsey Cargen was great with communication during the loan process. The customer felt well-informed and appreciated the clear communication. This indicates that the company values effective communication with its customers."
  },
  {
    "comment_id":"26093c00-94fe-4c2d-988b-0350e7becbd5",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Cassie was awesome and provided great customer service by understanding the customer's problem and finding a solution that worked for them."
  },
  {
    "comment_id":"5892ca04-e813-4bca-8bc3-8da96fca2c68",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the loan process was made easy by Stephanie Wilkinson. This indicates that the usability of the loan process was positive."
  },
  {
    "comment_id":"5892ca04-e813-4bca-8bc3-8da96fca2c68",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the loan process was completed without leaving their house. This suggests that the speed and performance of the loan process was positive."
  },
  {
    "comment_id":"5892ca04-e813-4bca-8bc3-8da96fca2c68",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The customer praised Stephanie Wilkinson for providing everything they needed and securely sending the loan documents via email. This indicates positive customer service."
  },
  {
    "comment_id":"5892ca04-e813-4bca-8bc3-8da96fca2c68",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The customer mentioned that Stephanie Wilkinson provided everything they needed via email, indicating effective communication."
  },
  {
    "comment_id":"ba60ac74-f153-43b1-a2b7-a469fe3cde9f",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that their auto loan experience was smooth and speedy, indicating that the usability of the loan process was positive."
  },
  {
    "comment_id":"ba60ac74-f153-43b1-a2b7-a469fe3cde9f",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The customer mentioned that their auto loan experience was smooth and speedy, indicating that the speed and performance of the loan process was positive."
  },
  {
    "comment_id":"ba60ac74-f153-43b1-a2b7-a469fe3cde9f",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The customer mentioned being in constant contact with a banking professional via email, indicating positive customer service."
  },
  {
    "comment_id":"ba60ac74-f153-43b1-a2b7-a469fe3cde9f",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The customer mentioned being in constant contact with a banking professional via email, indicating positive communication."
  },
  {
    "comment_id":"6055350f-8105-493c-8d98-722a88ec6a18",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that the credit union is easy to work with for new customers and they are super helpful and welcoming. This indicates a positive experience with the usability of their services."
  },
  {
    "comment_id":"6055350f-8105-493c-8d98-722a88ec6a18",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The comment states that the customer got approved in a short time for their son's first-time car loan. This suggests a positive experience with the speed and performance of the credit union's approval process."
  },
  {
    "comment_id":"6055350f-8105-493c-8d98-722a88ec6a18",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that the credit union is super helpful and welcoming, indicating a positive experience with their customer service."
  },
  {
    "comment_id":"8639a854-9eb2-4578-a0ca-21688509ae2f",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Paul LeBlond took the time to do detective work to solve the issue, indicating a positive experience with customer service."
  },
  {
    "comment_id":"cd475a0b-2b23-4dc0-be80-e02a794275e0",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that the loan process was smooth and simple, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"cd475a0b-2b23-4dc0-be80-e02a794275e0",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Happy Alexander was excellent and kept the customer informed and updated, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"cd475a0b-2b23-4dc0-be80-e02a794275e0",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The comment mentions that Happy Alexander kept the customer informed and updated, indicating a positive experience with the communication."
  },
  {
    "comment_id":"2b20e750-777a-42c1-8817-b1db1c52e781",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the approval process was easy, indicating positive usability of the loan application process."
  },
  {
    "comment_id":"2b20e750-777a-42c1-8817-b1db1c52e781",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The customer mentioned that important updates and details were communicated in a timely manner, indicating positive speed\/performance in terms of communication."
  },
  {
    "comment_id":"2b20e750-777a-42c1-8817-b1db1c52e781",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The customer mentioned that Chelsey made the approval process easy and communicated important updates, indicating positive customer service experience."
  },
  {
    "comment_id":"2b20e750-777a-42c1-8817-b1db1c52e781",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The customer mentioned that important updates and details were communicated in a timely manner, indicating positive communication experience."
  },
  {
    "comment_id":"5edc879d-c7e8-496b-8ca1-320837bd40fa",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Sarah was available, kind, prompt, and thoughtful. She explained everything really well and guided us through our first time taking out a mortgage. She moved quickly, the rates she quoted were better than other lenders (sometimes by a whole point!) and she was fun to work with. We couldn't recommend her or Evergreen more highly!"
  },
  {
    "comment_id":"5edc879d-c7e8-496b-8ca1-320837bd40fa",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"Sarah explained everything really well and guided us through our first time taking out a mortgage. She moved quickly and was fun to work with."
  },
  {
    "comment_id":"5c25a047-0c68-4d65-8030-324549c88b8e",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that the refinance process was extremely easy, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"5c25a047-0c68-4d65-8030-324549c88b8e",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The comment states that the refinance was done quickly and efficiently, suggesting a positive experience with the speed and performance of the service."
  },
  {
    "comment_id":"5c25a047-0c68-4d65-8030-324549c88b8e",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment praises Alexander for her professional skills and recommends the credit union, indicating a positive experience with the customer service provided."
  },
  {
    "comment_id":"5c25a047-0c68-4d65-8030-324549c88b8e",
    "Category":"Product Features\/Functionality",
    "Nature":"positive",
    "Analysis":"The comment mentions that Alexander suggested balance transferring high interest credit cards, indicating a positive experience with the product features and functionality provided."
  },
  {
    "comment_id":"3d49b719-d30a-4573-9efd-376f3b4200ac",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that all bank employees are great, helpful, and always have the answer, indicating positive feedback about the customer service provided by the bank."
  },
  {
    "comment_id":"c2229707-5b51-4871-8879-03d06f452f8d",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer feedback mentions that the customer service received from Karen Durling at the Naples branch was excellent. This indicates a positive experience with the customer service provided."
  },
  {
    "comment_id":"9c8b197e-47fa-4c0d-9919-bd94009c1980",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned receiving excellent service and help from all of the employees, especially Chesley and Heidi."
  },
  {
    "comment_id":"0ee3dd5e-761f-4767-9cd7-ebb861d59ca8",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Bailey displayed excellent customer service skills"
  },
  {
    "comment_id":"01bbc9b6-4787-498b-bede-80759cf30e2b",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Amanda Southworth from ECU provided great advice, remained very responsive, and assisted the customer in a fluid market. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"01bbc9b6-4787-498b-bede-80759cf30e2b",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The comment mentions that Amanda Southworth from ECU reassured the customer and remained very responsive, indicating good communication during the vehicle shopping process."
  },
  {
    "comment_id":"40077d2c-16ba-46dd-802e-192704adbc87",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the woman on the telephone is extremely helpful and provides great customer service today."
  },
  {
    "comment_id":"976dc259-40f7-4730-84fb-a3ad05e1d650",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer feedback mentions that Chelsea was very gracious and pleasant to work with, providing help with credit card payments and easing the customer's stress. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"a6f822b7-543b-484a-a1d2-83564602a8bb",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that everyone was courteous and helpful, and specifically praises the loan officer for being helpful, efficient, and knowledgeable."
  },
  {
    "comment_id":"b1e60d2a-bbef-41a8-9573-e197b565e903",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions the personal concern received from Sarah and Heidi, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"7755ab71-25f7-4957-884b-406a643bbd18",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that the loan process was fast and easy, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"7755ab71-25f7-4957-884b-406a643bbd18",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The comment states that the loan process was fast, indicating a positive experience with the speed and performance of the service."
  },
  {
    "comment_id":"7755ab71-25f7-4957-884b-406a643bbd18",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that the person handling the transaction was terrific and offered to help refinance other loans, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"fad1a277-148f-48f6-9d65-8c96cb360c9e",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentions receiving excellent customer service and pleasant people helping them. They have been banking with Evergreen Credit Union since they started working as a teenager and have always been happy with their service."
  },
  {
    "comment_id":"e8c1d25d-ac15-43ed-8b43-426fbf5b903b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Isaiah was extremely helpful in answering any questions regarding the issue I encountered with my account. He was knowledgeable, friendly, and confident he could help find a solution. He should be used as an example for how to interact with customers and help them through their issues."
  },
  {
    "comment_id":"b8872e94-ccbb-4aef-b249-58ef6f29588c",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Best customer service and experience', indicating a positive sentiment towards the customer service provided by Evergreen."
  },
  {
    "comment_id":"d1381517-2991-478c-b98c-5e38f7f77f43",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer feedback mentions that the process was hassle-free, easy, and fast, indicating a positive experience with the usability of the banking institution."
  },
  {
    "comment_id":"d1381517-2991-478c-b98c-5e38f7f77f43",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer feedback highlights the fast process of getting an RV loan and receiving the check within 2 days, indicating a positive experience with the speed and performance of the banking institution."
  },
  {
    "comment_id":"d1381517-2991-478c-b98c-5e38f7f77f43",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer feedback states that it was one of the best experiences with a banking institution, indicating a positive experience with the customer service provided by Evergreen CU.ie."
  },
  {
    "comment_id":"3e24c907-6036-4544-8653-b398dbfdd879",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the entire process was effortless, simple, and fast, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"3e24c907-6036-4544-8653-b398dbfdd879",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the entire process took about 3 days from their first reaching out to picking up their new purchase, indicating a positive experience with the speed and performance of the service."
  },
  {
    "comment_id":"3e24c907-6036-4544-8653-b398dbfdd879",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that they would definitely recommend working with the company, indicating a positive experience with the customer service provided."
  },
  {
    "comment_id":"b275bbee-24ea-4aa7-a296-818f8b93e485",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Isaiah and his team provided amazing service and commitment to the customers and the team."
  },
  {
    "comment_id":"5a0e61c5-2a71-4fd5-a34d-b8ccb3f6b1e1",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Casey was fantastic to work with throughout the loan process. She was quickly able to solve any issue I encountered, even on a weekend!"
  },
  {
    "comment_id":"065cc246-53cc-41cb-801e-a053563ea090",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the loan officer, Megan Dudley, was professional, quick, and effective, indicating a positive experience with the customer service provided by the Loan department."
  },
  {
    "comment_id":"5ef79752-b149-429c-817c-a98fda39802d",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment expresses appreciation for how genuine and honest Jennel Berry from the Windham branch has treated the customer with their banking needs."
  },
  {
    "comment_id":"6c6c803e-e977-4467-9e91-ea5683376eff",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentions that Evergreen's mobile banking is easy to navigate, indicating positive usability."
  },
  {
    "comment_id":"6c6c803e-e977-4467-9e91-ea5683376eff",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer states that Evergreen has always been helpful, attentive, professional, and happy to answer any questions, indicating positive customer service."
  },
  {
    "comment_id":"a350783f-9b83-434f-b45c-b266a62ee74f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Judy was quick to look into my issue and resolved it so timely! She was VERY sweet and informative!"
  },
  {
    "comment_id":"a350783f-9b83-434f-b45c-b266a62ee74f",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"Judy was VERY sweet and informative!"
  },
  {
    "comment_id":"6414aa20-3a62-4060-8530-299837dccaa6",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Sean\/Shawn was extremely helpful, listened to their problem, and resolved their issue in a timely and professional manner. This indicates positive customer service experience."
  },
  {
    "comment_id":"31e9338a-c4eb-4f28-9f6e-c5e9ae05a9ff",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned being happy with the service and the seamless transaction, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"4096baa0-efac-4752-9e23-4a056011034a",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the team never gave up and resolved the issue through tenacious dedication, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"71864d48-52cb-4095-a927-6cbf4b27dafa",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment expresses satisfaction with the credit union's customer service. The customer mentions that they are known by name and that the credit union goes above and beyond to meet their needs."
  },
  {
    "comment_id":"80e04f7d-f0a4-4a06-9d30-e6e8f4e219b4",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned being thrilled with the customer service received both online and in person. They described the staff as incredibly accommodating, friendly, and professional, and mentioned that everything went very smoothly. They also expressed their intention to do more business with the company in the future."
  },
  {
    "comment_id":"093c163d-af49-4139-810d-9a7acf31b47f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Chelsey was an awesome loan officer- she took amazing care of me and made sure I had everything I needed in order to secure the loan I needed to buy my car. She was kind, friendly and super thorough!"
  },
  {
    "comment_id":"b2c5a543-17f8-4b1d-b301-a8ad869e2518",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the process of opening up their accounts and credit cards was smooth and helpful, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"b2c5a543-17f8-4b1d-b301-a8ad869e2518",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the customer representative was very helpful with their questions, indicating a positive experience with the customer service provided."
  },
  {
    "comment_id":"b2c5a543-17f8-4b1d-b301-a8ad869e2518",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the facility was cheerful and the staff was friendly, indicating a positive experience with the communication aspect of the service."
  },
  {
    "comment_id":"b2c5a543-17f8-4b1d-b301-a8ad869e2518",
    "Category":"Product Features\/Functionality",
    "Nature":"positive",
    "Analysis":"The customer mentioned feeling confident with their decision to move to this credit union, indicating a positive experience with the product features and functionality."
  },
  {
    "comment_id":"b7313944-b102-4d05-8648-e32eac65d9af",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the team at Evergreen was tremendously helpful and they were there to answer any questions. This indicates positive customer service experience."
  },
  {
    "comment_id":"b7313944-b102-4d05-8648-e32eac65d9af",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the process was made easier and the team was there to answer any questions. This indicates positive communication experience."
  },
  {
    "comment_id":"255803dc-25ff-4e23-b876-2c7991ff01a6",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment does not mention anything specific about usability."
  },
  {
    "comment_id":"255803dc-25ff-4e23-b876-2c7991ff01a6",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The comment mentions that the response time was fast, indicating positive feedback about speed\/performance."
  },
  {
    "comment_id":"255803dc-25ff-4e23-b876-2c7991ff01a6",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Happy was very helpful, stayed in contact, and made the process simple, indicating positive feedback about customer service."
  },
  {
    "comment_id":"255803dc-25ff-4e23-b876-2c7991ff01a6",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The comment mentions that Happy stayed in contact and responded fast, indicating positive feedback about communication."
  },
  {
    "comment_id":"ae5e3551-050a-4c4c-9e55-37f450f096db",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the financial institution is always behind the customer's small business and Julie, along with all the girls in the local branch, are awesome to work with. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"d70d587f-d1d2-4b0d-a5ef-df60df2e86c1",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Heidi was extremely helpful through the process with me being in a tough time crunch. She made everything run as smoothly as possible for my situation and I am incredibly grateful."
  },
  {
    "comment_id":"a7c7aaa0-9078-4f51-80ac-5dd143eca0b6",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer feedback mentions having one of the best customer service experiences ever at EGCU. The staff members were described as professional, courteous, genuinely kind, and caring. The customer felt like they were part of a family and expressed gratitude towards the credit union for providing stellar customer service."
  },
  {
    "comment_id":"57254e00-6a46-4085-b865-f496cdd614b9",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process of applying and closing on a loan, as well as opening two accounts, was easy and timely. This indicates that the usability of the company's services is positive."
  },
  {
    "comment_id":"57254e00-6a46-4085-b865-f496cdd614b9",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process was timely, indicating that the speed and performance of the company's services are positive."
  },
  {
    "comment_id":"57254e00-6a46-4085-b865-f496cdd614b9",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer described the experience as helpful, friendly, and professional, indicating positive customer service."
  },
  {
    "comment_id":"57254e00-6a46-4085-b865-f496cdd614b9",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer described the experience as easy and friendly, indicating positive communication."
  },
  {
    "comment_id":"ada4c1d9-9b28-4fc8-8e62-443069594ac5",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that the loan officer made the process simple and stress-free, indicating positive usability experience."
  },
  {
    "comment_id":"ada4c1d9-9b28-4fc8-8e62-443069594ac5",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that the loan officer was always responsive, kept the customer in the loop, and made the process stress-free, indicating positive customer service experience."
  },
  {
    "comment_id":"ada4c1d9-9b28-4fc8-8e62-443069594ac5",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The comment mentions that the loan officer kept the customer in the loop every step of the way, indicating positive communication experience."
  },
  {
    "comment_id":"a19a4332-9a95-49f7-b027-b0a56b3715aa",
    "Category":"Pricing",
    "Nature":"Positive",
    "Analysis":"The customer mentioned getting a low rate credit card and saving $25 a month on their car payment, indicating that the pricing offered by the company is favorable."
  },
  {
    "comment_id":"a19a4332-9a95-49f7-b027-b0a56b3715aa",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer thanked Chelsea, indicating that they had a positive experience with the customer service provided by the company."
  },
  {
    "comment_id":"0d77ce10-c65a-49c4-80b5-12206456f25e",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Awesome customer service' which indicates a positive experience with the customer service provided by Evergreen."
  },
  {
    "comment_id":"90f94bef-09b0-4140-ad08-78e67dc5c644",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the member services rep, Julia Leighton, has gone above and beyond for the customer several times. The customer also expresses extreme satisfaction with all their dealings with her."
  },
  {
    "comment_id":"2042533e-88c4-485c-8600-8aebc9488a62",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that Judy Brochu was extremely helpful and worked with the customer to provide the information needed. This indicates that the usability of the product or service was good and the customer had a positive experience."
  },
  {
    "comment_id":"2042533e-88c4-485c-8600-8aebc9488a62",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Judy Brochu was extremely helpful and worked with the customer to provide the information needed. This indicates that the customer service provided by Judy Brochu was positive."
  },
  {
    "comment_id":"2042533e-88c4-485c-8600-8aebc9488a62",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The comment mentions that Judy Brochu worked with the customer to format the information in different ways. This indicates good communication between Judy Brochu and the customer."
  },
  {
    "comment_id":"46930994-f34d-47e2-a5f6-add45f2c66cf",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the car loan process with Evergreen was very professional and they worked to make it fit their schedule. This indicates that the usability of the car loan process was impressive and user-friendly."
  },
  {
    "comment_id":"46930994-f34d-47e2-a5f6-add45f2c66cf",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The customer mentioned that the process was very professional and they worked to make it fit their schedule. This indicates that the customer service provided by Evergreen was excellent."
  },
  {
    "comment_id":"3ce6cabb-28fa-41a9-b0d4-cfb9d37643de",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the loan process was done faster than expected, indicating a positive experience with the speed and performance of the service."
  },
  {
    "comment_id":"3ce6cabb-28fa-41a9-b0d4-cfb9d37643de",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Karen took charge and provided a great experience, indicating positive customer service."
  },
  {
    "comment_id":"ce414a7b-952e-421a-84e3-6ab18366b038",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the entire process was quick and convenient, indicating a positive experience with the speed and performance of the service."
  },
  {
    "comment_id":"ce414a7b-952e-421a-84e3-6ab18366b038",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer expressed satisfaction with the service provided by the Evergreen staff, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"42ff1453-1dc9-47dc-93a5-23e625012235",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Paige was extraordinarily helpful and patient, indicating positive customer service experience."
  },
  {
    "comment_id":"74488d70-026e-4d60-bf0a-7b5e6a3c8dba",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Joelle made everything easy, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"74488d70-026e-4d60-bf0a-7b5e6a3c8dba",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that everyone at the branch was pleasant and helpful, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"9abcc316-0979-4e65-8f91-97e57603b836",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"Chelsey was wonderful! She helped me refinance my auto loan. I had no idea where to start & she told me exactly what docs I needed to get & set up all the paperwork. Plus, she's really nice! 10\/10"
  },
  {
    "comment_id":"5381854b-0fd2-4fc5-a744-ca0950f516c7",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Chelsey was fantastic start to finish. She explained everything thoroughly and did so in a warm and caring manner. She’s the best!"
  },
  {
    "comment_id":"dc749138-19b5-4eb4-999c-52382c3e0cab",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Isaiah Wright was extremely helpful and responsive throughout the entire process. 10\/10 would recommend him for any kind of loan assistance."
  },
  {
    "comment_id":"27300276-4170-48f7-a970-da9ab948a92d",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Chelsey was very helpful and clear, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"27300276-4170-48f7-a970-da9ab948a92d",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Chelsey was very helpful and clear, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"27300276-4170-48f7-a970-da9ab948a92d",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Chelsey was very clear, indicating a positive experience with the communication."
  },
  {
    "comment_id":"01720dc0-34a2-4c6d-a1f3-a806c7ee4dd4",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentions that Evergreen has always listened to their concerns and was always there when needed, indicating positive customer service experience."
  },
  {
    "comment_id":"8e67d893-e9ed-411b-87d6-a65b04bc9c1d",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Abbie Taylor made the process easy and simple, indicating positive customer service experience."
  },
  {
    "comment_id":"a182fa4f-1b56-47e7-a487-f48bd4636a8e",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Judy was friendly, responded promptly, found a solution right away, and went above and beyond to help. This indicates positive customer service experience."
  },
  {
    "comment_id":"dcddb36a-6f6f-47be-b951-a8f1cb2e5f60",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the staff is helpful, knowledgeable, and always greets with a smile. They also do everything they can to help resolve any problems. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"7000db0d-8630-45ff-8740-15499efaf0a2",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Karen provided a very good experience, was thorough, explicit in explanations, and very personable. The customer also states that they could not have asked for better service. This indicates positive feedback regarding the customer service."
  },
  {
    "comment_id":"8fb010f8-ec31-4238-b34c-7062d6be7116",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the financing process for their new vehicle was amazingly easy, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"8fb010f8-ec31-4238-b34c-7062d6be7116",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Isaiah made the process easy, indicating a positive experience with the customer service provided."
  },
  {
    "comment_id":"793b4daf-37ad-48fa-859d-8f9832dd30dc",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Mr. Leblond was pleasant, gave complete answers to the customer's questions, and made the customer feel like their account was important to ECU. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"40106072-b287-43f5-ac9c-7716c53a1555",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the customer service at the Portland branch is absolutely amazing, friendly, and willing to help."
  },
  {
    "comment_id":"23c55557-c10d-4247-984f-12b5e767141b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Excellent service', 'Quick and efficient', and 'All my questions were answered timely', indicating a positive experience with the customer service."
  },
  {
    "comment_id":"5df97412-e5ab-4282-8b1c-6d006682e829",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions experiencing issues with the online portal, indicating a usability problem. However, the customer praises Jennel Berry for figuring out and fixing the problem quickly, suggesting that the overall usability of the portal is positive."
  },
  {
    "comment_id":"5df97412-e5ab-4282-8b1c-6d006682e829",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer praises Jennel Berry for her amazing customer service, indicating a positive experience with the company's customer service."
  },
  {
    "comment_id":"b939d811-6521-4c24-8c4a-6c0764d29ef5",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Excellent service' and 'everybody is so helpful', indicating a positive experience with customer service."
  },
  {
    "comment_id":"150a10af-6da0-4e81-8818-e9ac68beaaca",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Chelsey Cargen was the most helpful person encountered, professional, proficient, kind, and understanding. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"3f1b9905-3dcb-4486-a653-7db916ac1a3f",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the online and mobile app provided a great banking experience, indicating that the usability of these platforms is excellent."
  },
  {
    "comment_id":"3f1b9905-3dcb-4486-a653-7db916ac1a3f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer praised the friendly and courteous staff, indicating that the customer service provided by the company is exceptional."
  },
  {
    "comment_id":"3f1b9905-3dcb-4486-a653-7db916ac1a3f",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the communication services provided by the company are stellar, indicating that the company effectively communicates with its customers."
  },
  {
    "comment_id":"3f1b9905-3dcb-4486-a653-7db916ac1a3f",
    "Category":"Product Features\/Functionality",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the company's services, including loans, have excellent features and functionality, indicating that the company offers innovative and useful product features."
  },
  {
    "comment_id":"15a70b4b-e216-4fd4-8064-9d5ebefb665f",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the service was easy to use, indicating a positive experience with the usability of the product or service."
  },
  {
    "comment_id":"15a70b4b-e216-4fd4-8064-9d5ebefb665f",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The comment states that the service was fast, suggesting a positive experience with the speed and performance of the product or service."
  },
  {
    "comment_id":"15a70b4b-e216-4fd4-8064-9d5ebefb665f",
    "Category":"Customer Service",
    "Nature":"Negative",
    "Analysis":"The comment mentions that it took longer with the automated line compared to customer service (CS), indicating a negative experience with the customer service aspect of the product or service."
  },
  {
    "comment_id":"73d6ff35-fdbf-4533-9ad1-4f1d475c531e",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that they spoke with Paul about a persistent problem and it was resolved. This indicates that the customer service provided by Paul was effective in addressing the issue."
  },
  {
    "comment_id":"c79d82ad-f574-4908-a537-7cc869c6c142",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The customer mentioned that they were able to open the required account, indicating that the usability of the account opening process was good."
  },
  {
    "comment_id":"c79d82ad-f574-4908-a537-7cc869c6c142",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The customer mentioned that their loan was processed in a timely manner, indicating that the speed and performance of the loan processing was satisfactory."
  },
  {
    "comment_id":"acb7d28a-3d7b-4825-a50c-2b66b66d895c",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions having issues using the computer at home, but the customer states that Chelsey Cargen took care of it every time, making it easy for them. This indicates that Chelsey Cargen provided good support and assistance in resolving the usability issues."
  },
  {
    "comment_id":"acb7d28a-3d7b-4825-a50c-2b66b66d895c",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment states that Chelsey Cargen was great every step of the way, took care of the customer's issues, and made it easy for them. The customer also mentions feeling trust in Chelsey Cargen with their finances. This indicates positive customer service experience."
  },
  {
    "comment_id":"acb7d28a-3d7b-4825-a50c-2b66b66d895c",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The comment indicates that Chelsey Cargen was responsive and helpful in addressing the customer's issues with their computer at home. This suggests good communication skills and customer support."
  },
  {
    "comment_id":"c3ffec12-40ca-49d6-a9ab-4dd8397ed290",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Bailey was friendly, professional, and very helpful. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"8b8bd39d-db79-49b9-b28c-b7cd5f57631a",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that working with Cassie Bernier from Evergreen is great and she always makes things go smoothly. This indicates positive customer service experience."
  },
  {
    "comment_id":"4ca19299-bb2d-4f3e-88c6-1fbc0aa78354",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Chelsey was detailed and super friendly! She made it a very easy experience. I’d definitely recommend Evergreen to anyone!"
  },
  {
    "comment_id":"cc74ee86-7f73-4afe-a844-ebe60a841d26",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Paul helped the customer with a question about CDs and was friendly and efficient. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"269980d3-126e-4f2a-847d-8152f1a894a9",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the customer had a wonderful experience and the representative answered their questions in a professional manner."
  },
  {
    "comment_id":"269980d3-126e-4f2a-847d-8152f1a894a9",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the representative was a joy to speak with, indicating good communication."
  },
  {
    "comment_id":"1518ac56-7e92-48b7-9eb5-e99963c9dab4",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment indicates that the agent knew exactly what the customer needed and provided assistance, which suggests a positive experience with the customer service."
  },
  {
    "comment_id":"1bfc3ed0-cb13-4758-b31b-f791408704d1",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the customer service is very good and all questions were answered in a way that the customer could understand."
  },
  {
    "comment_id":"a32fbe70-fa8e-4d85-b475-cbcb6312beb0",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Jennel did an excellent job, was very professional, helpful, and pleasant to deal with. This indicates a positive experience with the customer service provided by Jennel."
  },
  {
    "comment_id":"204e1142-02c8-4a39-be37-eec7f680f0ae",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Great customer service & friendly folks' and 'Everything was fully explained and easily understandable', indicating a positive experience with the customer service."
  },
  {
    "comment_id":"1d60569b-53f4-4b9b-b9d2-302b03925e67",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the customer service rep was very patient and kind in helping resolve the password issue, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"c43c5c73-8e9d-4b31-8542-b23298c03112",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that they couldn't be happier with their experience, indicating a positive sentiment towards the usability of EGCU."
  },
  {
    "comment_id":"c43c5c73-8e9d-4b31-8542-b23298c03112",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that EGCU was helpful and courteous, indicating a positive sentiment towards their customer service."
  },
  {
    "comment_id":"c43c5c73-8e9d-4b31-8542-b23298c03112",
    "Category":"Product Quality",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that EGCU is the best in the business, indicating a positive sentiment towards the product quality."
  },
  {
    "comment_id":"7e153130-82bb-424a-ad1b-853bcc70240b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that it took a while, but the company was able to get the information needed for their application. This indicates that the customer had a positive experience with the customer service as they were able to fulfill the customer's request."
  },
  {
    "comment_id":"ef30c602-67b6-4af9-bfef-180432f4e7de",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Karen and all the Evergreen staff were amazing to work with for the vehicle loan, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"ecb728e6-92e4-40d9-9980-e33f2eababae",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the customer was able to accomplish everything they wanted quickly, indicating that the usability of the product or service is good."
  },
  {
    "comment_id":"ecb728e6-92e4-40d9-9980-e33f2eababae",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The comment states that the customer was in and out quickly, suggesting that the speed and performance of the product or service met their expectations."
  },
  {
    "comment_id":"a2280318-ed38-4e1d-92dc-11e5aa429289",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that Rebecca solved the problem quickly and easily, indicating that the usability of the product or service is good."
  },
  {
    "comment_id":"a2280318-ed38-4e1d-92dc-11e5aa429289",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The comment mentions that Rebecca solved the problem quickly, indicating that the speed\/performance of the product or service is good."
  },
  {
    "comment_id":"a2280318-ed38-4e1d-92dc-11e5aa429289",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Rebecca solved the problem quickly and easily, indicating that the customer service provided by Rebecca is good."
  },
  {
    "comment_id":"ef87d0f7-9948-4cc1-ba8e-11af329ec054",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Thank you member services for helping me find some very old checks from years ago to help me avoid having to pay them again.' This indicates that the customer received assistance from the member services team, which is a positive aspect of customer service."
  },
  {
    "comment_id":"ef87d0f7-9948-4cc1-ba8e-11af329ec054",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Anne and Sean were a great help!!!!!' This indicates that the customer had a positive experience with the communication from Anne and Sean, which is a positive aspect of communication."
  },
  {
    "comment_id":"919d06bf-9684-42f7-ac7c-5c1488f669cf",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment indicates that the customer received assistance, which suggests a positive experience with the customer service."
  },
  {
    "comment_id":"e2ac426f-a137-44a0-8043-aceab1ea912c",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions having great customer service."
  },
  {
    "comment_id":"2cee80e4-7b04-4d8e-8434-825babefbab1",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The loan officer was very knowledgeable and courteous."
  },
  {
    "comment_id":"2cee80e4-7b04-4d8e-8434-825babefbab1",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The loan officer explained my loan well."
  },
  {
    "comment_id":"dda5bbeb-a668-4265-a938-193c7fcd2422",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the customer found the customer service representative very pleasant to speak to and very knowledgeable."
  },
  {
    "comment_id":"07d2196b-713f-4072-9bba-f61a0860f973",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Always the best service' and 'Cheers to Ross at the South Portland branch', indicating a positive experience with customer service."
  },
  {
    "comment_id":"0c79d813-e0f3-4fa0-8fd3-f454191a754f",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the experience was amazing and very helpful, indicating a positive sentiment towards the usability of the product or service."
  },
  {
    "comment_id":"0c79d813-e0f3-4fa0-8fd3-f454191a754f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Chealsy was very helpful and the whole experience was very happy, indicating a positive sentiment towards the customer service provided."
  },
  {
    "comment_id":"1d92ca49-b584-4cee-94cc-a14bb135b775",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The comment mentions a fast and efficient loan process, indicating a positive experience with the speed and performance of the service."
  },
  {
    "comment_id":"885ee47c-2c66-4ab0-8702-797122f86c57",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer feedback indicates that the loan process was hassle-free and the staff made everything easy with just a few phone calls. This suggests that the usability of the loan application and overall process was smooth and user-friendly."
  },
  {
    "comment_id":"885ee47c-2c66-4ab0-8702-797122f86c57",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer feedback mentions that the paperwork signing process was quick, taking only about 10 minutes. This indicates that the speed and performance of the loan processing and paperwork handling was efficient."
  },
  {
    "comment_id":"885ee47c-2c66-4ab0-8702-797122f86c57",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer feedback states that the staff had everything done with just a few phone calls and that they were on their A game. This suggests that the customer service provided by the staff was excellent and efficient."
  },
  {
    "comment_id":"4decf188-4a21-4d6b-b84c-7cee35609b0f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the service and assistance received was stellar, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"f25dd2f6-8860-4cdb-9527-e62bb310985d",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process was easy, indicating a positive experience with the usability of the product or service."
  },
  {
    "comment_id":"f25dd2f6-8860-4cdb-9527-e62bb310985d",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that everyone involved was speedy with the process, indicating a positive experience with the speed and performance of the product or service."
  },
  {
    "comment_id":"f25dd2f6-8860-4cdb-9527-e62bb310985d",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that everyone involved was helpful, indicating a positive experience with the customer service provided."
  },
  {
    "comment_id":"8cd54941-6ac2-4897-a16f-5c61d2e7c71f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Heidi was very helpful and kept us posted on each step as it went on. She has always been great to work with."
  },
  {
    "comment_id":"8cd54941-6ac2-4897-a16f-5c61d2e7c71f",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"Heidi was very helpful and kept us posted on each step as it went on. She has always been great to work with."
  },
  {
    "comment_id":"212e7ee9-49e2-4ddb-a26a-47e298af6b7c",
    "Category":"Usability",
    "Nature":"Negative",
    "Analysis":"The comment mentions that the business debit cards are set by default to allow going negative for basic in-store purchases, which led to convenience fees. This indicates a negative experience with the usability of the business debit cards."
  },
  {
    "comment_id":"212e7ee9-49e2-4ddb-a26a-47e298af6b7c",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the company reversed one insufficient funds fee for the customer, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"212e7ee9-49e2-4ddb-a26a-47e298af6b7c",
    "Category":"Product Features\/Functionality",
    "Nature":"Negative",
    "Analysis":"The comment mentions that the company removed the option that allows the card to go negative for basic in-store purchases, indicating a negative experience with the product features\/functionality."
  },
  {
    "comment_id":"66fd0d09-53da-4072-b008-1d8dfae1c678",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the person was patient and informative, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"72e0340f-e3fd-4523-8e74-7bb8eca585ed",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Excellent customer service' which indicates a positive experience with the company's customer service."
  },
  {
    "comment_id":"1f4e5438-81d4-458c-960e-869c3ce10429",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Chelsey was great to work with for my car loan refinance. She made everything easy and took good care of me."
  },
  {
    "comment_id":"9f03625e-a9a9-4320-b681-7229e61e77f5",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"Exceeded expectations as far as service and speed"
  },
  {
    "comment_id":"9f03625e-a9a9-4320-b681-7229e61e77f5",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Responsive, polite, and competent"
  },
  {
    "comment_id":"33164303-406a-4a8b-a51d-a2640f138894",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment expresses gratitude for the hard work and enjoyment of having Evergreen as their banking provider, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"4a069755-2d2b-4a33-8c6f-62d2df818be1",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the service was great and very helpful, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"ef126a0d-7b58-4649-bdd6-4e64f4ea1758",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that as a first time loaner, it was made very easy and enjoyable. This indicates that the usability of the loaning process was positive and user-friendly."
  },
  {
    "comment_id":"24a01e3c-0ff1-4065-8900-cca58dc32368",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer expresses happiness to be part of the financial institution, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"327e2477-508c-4fa2-9533-7baa324fe8d3",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Abby was super nice and helpful."
  },
  {
    "comment_id":"f3834e28-2606-46f0-9324-2fd8eaff8f11",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions having a good experience every time they go in, indicating positive feedback about the customer service."
  },
  {
    "comment_id":"0b3e6a84-15ff-41a7-8db9-efb312ec8085",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions timely and excellent customer service from Chelsey, indicating a positive experience."
  },
  {
    "comment_id":"f2e603db-8eb0-49e7-a567-0b751a1a8dfc",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Chelsea was great to work with and everything was done efficiently and courteously, indicating a positive experience with customer service."
  },
  {
    "comment_id":"8dcc157b-cce8-482f-af01-ca9c55d8b1d5",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Paul handled the situation like a champ, indicating that the usability of the product or service was smooth and convenient for the customer."
  },
  {
    "comment_id":"8dcc157b-cce8-482f-af01-ca9c55d8b1d5",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment expresses gratitude for the convenience provided by Paul, indicating that the customer service was satisfactory."
  },
  {
    "comment_id":"b27f225f-c011-431f-badb-e02c0422076b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the lender, Happy, always got back to the customer and was happy and kind. This indicates a positive experience with the customer service provided."
  },
  {
    "comment_id":"b27f225f-c011-431f-badb-e02c0422076b",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the lender, Happy, always got back to the customer. This indicates effective communication."
  },
  {
    "comment_id":"015984e7-66b5-4309-866a-bdee8b10e9e3",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions working with Gloria and describes her as a true asset, indicating a positive experience with the customer service provided by Gloria."
  },
  {
    "comment_id":"84c79b07-e25c-4626-90d2-314a8419cb21",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment expresses gratitude for the help received, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"344adc82-2761-48db-a3e9-efec008a56df",
    "Category":"Customer Service",
    "Nature":"Negative",
    "Analysis":"The customer mentioned that there was always an excuse as to why the girl helping wouldn't call them back. This indicates a lack of responsiveness and poor customer service."
  },
  {
    "comment_id":"344adc82-2761-48db-a3e9-efec008a56df",
    "Category":"Communication",
    "Nature":"Negative",
    "Analysis":"The customer mentioned that they requested a debit card and thought they opened a checking account online, but when they went to the bank, they were told their account was just a savings account. The customer asked for it to be changed to a checking account but was told it couldn't be done immediately. This lack of clear communication and failure to meet the customer's expectations is a negative aspect."
  },
  {
    "comment_id":"9387e5e8-e128-4b41-b982-b32e9762b180",
    "Category":"Customer Service",
    "Nature":"Negative",
    "Analysis":"The customer mentioned that they were told they had the loan on a Monday, but then on Tuesday they were told they didn't get the loan. This indicates a negative experience with the customer service of Evergreen."
  },
  {
    "comment_id":"9387e5e8-e128-4b41-b982-b32e9762b180",
    "Category":"Communication",
    "Nature":"Negative",
    "Analysis":"The customer mentioned that they were told conflicting information about the loan, which indicates a lack of clear communication from Evergreen."
  },
  {
    "comment_id":"3e1dff2e-2a63-41ca-8d8c-4f786091b678",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the staff is always helpful and quick to get back to the customer, indicating a positive experience with customer service."
  },
  {
    "comment_id":"3e1dff2e-2a63-41ca-8d8c-4f786091b678",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that knowing the people they deal with makes their business with Evergreen much more enjoyable, indicating positive communication experiences."
  },
  {
    "comment_id":"4631c98e-a8cc-4161-8543-14b6b0c577c5",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Judy was professional, informative, and respectful, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"ad4ec0dc-17ef-4482-bb5a-b66fc10dba61",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that it is simple to communicate and transfer documents, indicating that the usability of the product is good."
  },
  {
    "comment_id":"ad4ec0dc-17ef-4482-bb5a-b66fc10dba61",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that it is simple to communicate, indicating that the communication aspect of the product is good."
  },
  {
    "comment_id":"aee26563-1cbe-4097-8809-63a96bfbb513",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the website is 'pretty awesome and easy to set up.' This indicates a positive experience with the usability of the website."
  },
  {
    "comment_id":"aee26563-1cbe-4097-8809-63a96bfbb513",
    "Category":"Speed\/Performance",
    "Nature":"Negative",
    "Analysis":"The customer complained about the slowness of the company in general, both in terms of loan initiation and billing. This indicates a negative experience with the speed and performance of the company."
  },
  {
    "comment_id":"aee26563-1cbe-4097-8809-63a96bfbb513",
    "Category":"Billing\/Invoicing",
    "Nature":"Negative",
    "Analysis":"The customer mentioned that they received their bill information only 4 days prior to the due date, which made them nervous as they usually pay bills well before they are due. This indicates a negative experience with the billing\/invoicing process."
  },
  {
    "comment_id":"84bca359-a635-4a98-add1-327f62ed4261",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Great ease of use', indicating a positive experience with the usability of the product."
  },
  {
    "comment_id":"dc2f575b-3540-4b93-b361-9e297eee0cda",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that everyone has been super helpful and welcoming, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"2e83417f-a034-4c18-a841-17107d64802c",
    "Category":"Usability",
    "Nature":"Negative",
    "Analysis":"The customer mentioned that they tried to add an outside banking source and the website stated that a transfer was made for a specific amount, but the transfer was not actually made. This indicates a usability issue with the website's functionality for adding external banking sources."
  },
  {
    "comment_id":"45f8928c-7492-423e-8f35-b439626250ed",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process was very easy, indicating a positive experience with the usability of the product or service."
  },
  {
    "comment_id":"45f8928c-7492-423e-8f35-b439626250ed",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process was quick, indicating a positive experience with the speed or performance of the product or service."
  },
  {
    "comment_id":"3184a6e0-ea39-45f7-ba88-21c74a6a2aa1",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Great staff' and 'worked hard to get my loan approved', indicating positive customer service experience."
  },
  {
    "comment_id":"a7c6353b-f7e7-40a4-b0cd-b0381803a3d9",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the branch is clean and easy to process paperwork, indicating a positive experience with the usability of the services."
  },
  {
    "comment_id":"a7c6353b-f7e7-40a4-b0cd-b0381803a3d9",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the branch is very welcoming and has solid communication, indicating a positive experience with the customer service provided."
  },
  {
    "comment_id":"a7c6353b-f7e7-40a4-b0cd-b0381803a3d9",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions solid communication, indicating a positive experience with the communication provided by the company."
  },
  {
    "comment_id":"cef04b40-3740-4a68-a704-d7df9f660a7c",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that the experience was quick and easy, indicating positive usability."
  },
  {
    "comment_id":"cef04b40-3740-4a68-a704-d7df9f660a7c",
    "Category":"Speed\/Performance",
    "Nature":"positive",
    "Analysis":"The comment mentions that the experience was quick, indicating positive speed\/performance."
  },
  {
    "comment_id":"cef04b40-3740-4a68-a704-d7df9f660a7c",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that the company was awesome, indicating positive customer service."
  },
  {
    "comment_id":"b3659a82-710f-4033-973c-cc647ac3e35e",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Bailey understood the online issue and fixed it immediately, indicating that the usability of the online platform was good and the issue was resolved efficiently."
  },
  {
    "comment_id":"b3659a82-710f-4033-973c-cc647ac3e35e",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Bailey understood the online issue and fixed it immediately, indicating that the customer service provided by Bailey was prompt and effective."
  },
  {
    "comment_id":"0d54d8ea-89f0-4b84-87a3-f206cb37bf67",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Excellent customer service' and 'Very knowledgeable staff', indicating a positive experience with the customer service."
  },
  {
    "comment_id":"b871a460-1cdb-4dd2-acf6-42b958caff41",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions quick and helpful assistance, indicating that the usability of the product or service is good."
  },
  {
    "comment_id":"b871a460-1cdb-4dd2-acf6-42b958caff41",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The comment mentions quick and helpful assistance, indicating that the speed and performance of the product or service is good."
  },
  {
    "comment_id":"b871a460-1cdb-4dd2-acf6-42b958caff41",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions quick and helpful assistance, indicating that the customer service provided is good."
  },
  {
    "comment_id":"502a78ad-e9a4-4a1a-8586-bb6cf71d3259",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Paul was very helpful."
  },
  {
    "comment_id":"49a65e15-6b43-4064-acfe-b4dc02775f00",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the people were very nice and the paperwork was there, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"a07c7ccc-33e3-4c46-8f2d-8b9a4b78619f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'knowledgeable customer service people', indicating a positive experience with the customer service team."
  },
  {
    "comment_id":"f0b9a82d-5adb-4879-8930-ce86bfa37d35",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Great customer service' which indicates a positive experience with the company's customer service."
  },
  {
    "comment_id":"29879bc3-dd09-4d36-b621-e0098ed023d2",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'thoughtful customer service' which indicates a positive experience with the company's customer service."
  },
  {
    "comment_id":"ef9a1b13-1fb4-4f8e-bb98-b0b47519966e",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'Excellent customer service!', indicating a positive experience with the company's customer service."
  },
  {
    "comment_id":"ab424156-bfab-4526-8320-928ea6639b41",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the loan service is quick and easy, indicating a positive experience with the usability of the service."
  },
  {
    "comment_id":"ab424156-bfab-4526-8320-928ea6639b41",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the loan service is quick, indicating a positive experience with the speed\/performance of the service."
  },
  {
    "comment_id":"ab424156-bfab-4526-8320-928ea6639b41",
    "Category":"Customer Service",
    "Nature":"Negative",
    "Analysis":"The comment mentions a bit of a wait on the phone for general help, indicating a negative experience with the customer service."
  },
  {
    "comment_id":"8a8ff017-9580-4c3c-a6bc-270b878680a2",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Sean was very helpful and efficient in helping with all the issues, indicating positive customer service experience."
  },
  {
    "comment_id":"b54049bb-3500-4b50-b142-20cf89fbd64e",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that Cassandra was excellent, always answered calls and emails, and helped solve problems when getting a loan. This indicates positive customer service experience."
  },
  {
    "comment_id":"b54049bb-3500-4b50-b142-20cf89fbd64e",
    "Category":"Communication",
    "Nature":"positive",
    "Analysis":"The comment mentions that Cassandra always answered calls and emails, indicating good communication from the company."
  },
  {
    "comment_id":"041341db-d282-4c90-9e53-160e3d7a2b5f",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer expresses gratitude for the time, effort, and professionalism shown during the processing of their commercial loan. They highly recommend Evergreen Credit Union."
  },
  {
    "comment_id":"8fb4c2dc-795b-4f68-8ea2-d1fd57bb468d",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Anne was wonderful to work with"
  },
  {
    "comment_id":"1ffca5c3-4f6e-4bf1-9012-57268863b280",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer received a prompt call this morning with a resolution, indicating good customer service."
  },
  {
    "comment_id":"dd9b4b23-f1cb-4bec-b71f-c4e722d4a93d",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Danielle was awesome, very responsive, and everything was very easy. This indicates a positive experience with the customer service."
  },
  {
    "comment_id":"dd9b4b23-f1cb-4bec-b71f-c4e722d4a93d",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Danielle was very responsive, indicating good communication."
  },
  {
    "comment_id":"0290f352-5f59-4eea-a1fd-28eca2d50b37",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Danielle at the Windham branch was most knowledgeable and helpful in us obtaining our boar loan at Richardson's Marina. Team effort well done!!"
  },
  {
    "comment_id":"ab46e301-f559-4890-9c64-df350ab1d649",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"Isaiah made getting a car loan easy. He was very nice and professional."
  },
  {
    "comment_id":"893ea537-cbeb-40ca-b8e0-5f7b67485827",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment states that everyone is always very polite and helpful, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"6bf49dfd-e0cf-432d-91a0-b39d8b1b2571",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process was easy and seamless, indicating a positive experience with the usability of the loan application."
  },
  {
    "comment_id":"6bf49dfd-e0cf-432d-91a0-b39d8b1b2571",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer applied online in the morning and closed in the afternoon, highlighting a positive experience with the speed and performance of the loan process."
  },
  {
    "comment_id":"6bf49dfd-e0cf-432d-91a0-b39d8b1b2571",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned Isaiah Wright in the loan department was very thorough and efficient, indicating a positive experience with the customer service provided."
  },
  {
    "comment_id":"0752e430-0b63-43de-9b97-434fe7cefb3b",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer loves the credit union and has been with them for years, indicating that they find the usability of their services to be satisfactory."
  },
  {
    "comment_id":"0752e430-0b63-43de-9b97-434fe7cefb3b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer's long-term association with the credit union suggests that they are satisfied with the customer service provided by the company."
  },
  {
    "comment_id":"6000630c-308a-458c-97dd-4d4dc1489e9d",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that applying online was simple, indicating that the usability of the process was easy and convenient."
  },
  {
    "comment_id":"6000630c-308a-458c-97dd-4d4dc1489e9d",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer stated that the whole process was easy and fast, suggesting that the speed and performance of the loan application and approval were satisfactory."
  },
  {
    "comment_id":"6000630c-308a-458c-97dd-4d4dc1489e9d",
    "Category":"Pricing",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Evergreen had a great rate & term that other local lenders could not beat, indicating that the pricing offered by Evergreen was competitive and favorable."
  },
  {
    "comment_id":"73a146ac-43c9-4c5f-ac90-66ac96c50e85",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the process was easy and all information and paperwork were ready, indicating a positive experience with the usability of Evergreen's services."
  },
  {
    "comment_id":"77cf22f1-8e2a-4700-b734-ac2125274659",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer found the usability of the loan inquiry process to be incredible and easy. They were able to quickly understand and navigate the process."
  },
  {
    "comment_id":"77cf22f1-8e2a-4700-b734-ac2125274659",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer had a short conversation about their needs and expectations and was reassured that the process would be quick. They were able to get a loan rate and appointment within a short period of time."
  },
  {
    "comment_id":"77cf22f1-8e2a-4700-b734-ac2125274659",
    "Category":"Pricing",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the loan rate they received was better than the dealerships they had been dealing with. This indicates that the pricing of the loan was favorable for the customer."
  },
  {
    "comment_id":"77cf22f1-8e2a-4700-b734-ac2125274659",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer had a positive experience with the customer service. They felt reassured and in line with the representative they spoke to, indicating good communication and understanding of their needs."
  },
  {
    "comment_id":"77cf22f1-8e2a-4700-b734-ac2125274659",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer had a short and effective conversation about their needs and expectations, indicating good communication between the customer and the representative."
  },
  {
    "comment_id":"24b84cff-7976-4bc9-8337-f7f7e059f93b",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the process was easy, indicating a positive experience with the usability of the product or service."
  },
  {
    "comment_id":"24b84cff-7976-4bc9-8337-f7f7e059f93b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the EGCU team went the extra mile to ensure the task was completed, indicating a positive experience with customer service."
  },
  {
    "comment_id":"89e76cf7-f60e-469d-98dd-ee0be1a75dac",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer feedback mentions that the customer service received during the applying process to the closing of the RV loan was fantastic. This indicates a positive experience with the credit union's customer service."
  },
  {
    "comment_id":"297c14b1-2ba0-4819-832d-5c0ae773b8da",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process was very simple, indicating a positive experience with the usability of the services provided by Evergreen Credit Union."
  },
  {
    "comment_id":"297c14b1-2ba0-4819-832d-5c0ae773b8da",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the email correspondence was done in a timely manner, suggesting a positive experience with the speed and performance of Evergreen Credit Union's loan department."
  },
  {
    "comment_id":"297c14b1-2ba0-4819-832d-5c0ae773b8da",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that their questions were answered rather quickly, indicating a positive experience with the customer service provided by Evergreen Credit Union."
  },
  {
    "comment_id":"297c14b1-2ba0-4819-832d-5c0ae773b8da",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that they had a lot of email correspondence, suggesting effective communication between the customer and Evergreen Credit Union."
  },
  {
    "comment_id":"9e310b78-23e7-4336-8d84-9281c13f57e9",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions having an excellent experience with Alice the manager while getting the loan confirmed. This indicates positive customer service."
  },
  {
    "comment_id":"0ab67d79-55c6-49a3-8f50-fc79529d0583",
    "Category":"Usability",
    "Nature":"positive",
    "Analysis":"The comment mentions that Kasie helped the customer with app registration and finding a shared credit union. This indicates that the usability of the Evergreen app was good and Kasie was able to guide the customer effectively."
  },
  {
    "comment_id":"0ab67d79-55c6-49a3-8f50-fc79529d0583",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment praises Kasie for her love for people and passion for service. This indicates that the customer service provided by Kasie was excellent."
  },
  {
    "comment_id":"8cb702d1-6ecc-4dde-a38d-8cf734fbe440",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions outstanding customer service and being guided expertly through the loan process. The loan officer, Alice Goodwin, is praised for making the whole process understandable and easy. This indicates a positive experience with the customer service provided by Evergreen Credit Union."
  },
  {
    "comment_id":"cb692d50-5b06-40bd-9894-b780e1a22832",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Heidi always makes everything so simple, indicating a positive experience with the usability of the product or service."
  },
  {
    "comment_id":"cb692d50-5b06-40bd-9894-b780e1a22832",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned working with Heidi for many years and described her as awesome, indicating a positive experience with the customer service provided by Heidi."
  },
  {
    "comment_id":"4bd9dbad-6d94-43d6-a09d-665a3de9f9bb",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer found Evergreen Credit Union easy to use and navigate, as they mentioned that the staff were friendly and helpful."
  },
  {
    "comment_id":"4bd9dbad-6d94-43d6-a09d-665a3de9f9bb",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer praised the staff at Evergreen Credit Union for being friendly and helpful, indicating a positive customer service experience."
  },
  {
    "comment_id":"4bd9dbad-6d94-43d6-a09d-665a3de9f9bb",
    "Category":"Product Features\/Functionality",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Evergreen Credit Union made the loan process easy, indicating positive feedback on the product features and functionality."
  },
  {
    "comment_id":"2e52dec8-24c6-4eb0-b829-d70cc058321a",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment mentions that the customer was helped quickly and the representative, Stephanie Wilkinson, was excellent to deal with."
  },
  {
    "comment_id":"6fbff5c2-9fc9-409b-a37f-968b984d5165",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that their experience was great and the process was easy, indicating positive usability."
  },
  {
    "comment_id":"6fbff5c2-9fc9-409b-a37f-968b984d5165",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Stephanie was very attentive and made the process simple, indicating positive customer service."
  },
  {
    "comment_id":"c564ea89-1aff-450e-ac85-105333780d02",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that Evergreen made the process of getting their boat loan very easy, indicating a positive experience with the usability of the loan application process."
  },
  {
    "comment_id":"31041e3c-63d5-4aa3-a753-2e0cd726d2b4",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the service was the fastest in their time of need, indicating a positive experience with the speed and performance of the service."
  },
  {
    "comment_id":"31041e3c-63d5-4aa3-a753-2e0cd726d2b4",
    "Category":"Pricing",
    "Nature":"Negative",
    "Analysis":"The customer mentioned that the transmission repair was very expensive, indicating a negative experience with the pricing of the service."
  },
  {
    "comment_id":"31041e3c-63d5-4aa3-a753-2e0cd726d2b4",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer praised the customer service, mentioning that the loan got approved and a check was written to the dealership within 72 hours. This indicates a positive experience with the customer service provided by Danielle Dulac."
  },
  {
    "comment_id":"31041e3c-63d5-4aa3-a753-2e0cd726d2b4",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the service was fast, friendly, and spot on, indicating a positive experience with the communication from the company."
  },
  {
    "comment_id":"e4b7f990-bb65-41bd-bda0-c3c3726e0e42",
    "Category":"Usability",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that the process of applying for a loan online was easy, indicating positive usability."
  },
  {
    "comment_id":"e4b7f990-bb65-41bd-bda0-c3c3726e0e42",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The customer received a phone call the next day after applying for the loan online, suggesting good speed\/performance."
  },
  {
    "comment_id":"e4b7f990-bb65-41bd-bda0-c3c3726e0e42",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned working out the terms and conditions of the loan over the phone, indicating positive customer service."
  },
  {
    "comment_id":"e4b7f990-bb65-41bd-bda0-c3c3726e0e42",
    "Category":"Communication",
    "Nature":"Positive",
    "Analysis":"The customer mentioned receiving a phone call and working out the terms and conditions of the loan, indicating positive communication."
  },
  {
    "comment_id":"9427f52e-ca0b-4c5e-80a7-1d7caaaf52fc",
    "Category":"Speed\/Performance",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the service is fast, indicating a positive experience in terms of speed and performance."
  },
  {
    "comment_id":"9427f52e-ca0b-4c5e-80a7-1d7caaaf52fc",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that the service is personable and friendly, indicating a positive experience with customer service."
  },
  {
    "comment_id":"9c07f578-1c00-4949-bbcf-ed210002344b",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions 'great service' which indicates a positive sentiment towards the customer service provided by the bank."
  },
  {
    "comment_id":"187a6ff6-6866-4b95-b936-8c653816a4e9",
    "Category":"Customer Service",
    "Nature":"positive",
    "Analysis":"The comment expresses positive sentiment towards the customer service of Evergreen Credit Union, mentioning that they have always been about the customer and helping them with their financial needs. The comment also highlights the friendliness and professionalism of the employees."
  },
  {
    "comment_id":"b07b6afc-7c55-43bb-b1e7-4ce6efbec1a0",
    "Category":"Usability",
    "Nature":"Negative",
    "Analysis":"The comment mentions that the usability is terrible and really bad, indicating a negative experience with the usability of the product or service."
  },
  {
    "comment_id":"b07b6afc-7c55-43bb-b1e7-4ce6efbec1a0",
    "Category":"Customer Service",
    "Nature":"Negative",
    "Analysis":"The comment suggests that the customer is considering doing business with someone else, indicating a negative experience with the customer service provided."
  },
  {
    "comment_id":"cb2185a5-d111-42d6-8ffb-a62f2f598065",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that their questions were answered promptly and everyone was courteous, indicating a positive experience with the customer service."
  },
  {
    "comment_id":"cb2185a5-d111-42d6-8ffb-a62f2f598065",
    "Category":"Product Quality",
    "Nature":"Positive",
    "Analysis":"The customer mentioned that they have always been happy with Evergreens service, implying satisfaction with the product quality."
  },
  {
    "comment_id":"4e7779b3-ac3a-4be0-8ffd-316a6b7f8abd",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentions being with Evergreen Credit Union for close to 40 years and still considering them the best, indicating positive customer service experiences over a long period of time."
  },
  {
    "comment_id":"1a294ded-f3f8-4b64-b6e1-d52d8921d5b8",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The customer mentions that the credit union has always treated them like a great customer and has been supportive to their financial future and dreams. This indicates positive customer service."
  },
  {
    "comment_id":"43139f27-a939-4a43-979a-3f5223867228",
    "Category":"Customer Service",
    "Nature":"Positive",
    "Analysis":"The comment mentions that Evergreen is always friendly and there when the customer needs them, indicating positive customer service."
  }
]